export {};
/**
Почему это лучше альтернатив?
Память: Мы не создаем 1 000 000 промисов сразу, если в массиве миллион URL. Мы итерируемся по списку постепенно.

Скорость: Нет «бутылочного горлышка» как в Promise.all группами. Если один URL «тупит», остальные каналы продолжают молотить очередь.

Контроль: Вы жестко контролируете нагрузку на клиент и сервер.

Нюанс: Если вам нужно сохранять строгий порядок результатов (чтобы results[0] соответствовал urls[0]), в функцию fetchWithTimeout стоит передавать индекс и записывать результат в массив по этому индексу: results[index] = data
 */
//# sourceMappingURL=test.d.ts.map